IdeaRS.Connections
PositionCode Enumeration
Compatible with IDEA StatiCa 0.0
 Represents the code of the position
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[FlagsAttribute]
public enum PositionCode
Members
Member name | Value | Description
Default | 0
LeftSide | 1 |  Lef side
RightSide | 2 |  Right side
BothSides | 3 |  Both sides
Center | 4 |  Center
Custom | 8 |  Custom (user defined) position
See Also
Reference
IdeaRS.Connections.Data Namespace